src/Documents/ПриказОЗачислении/ПриказОЗачислении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОЗачислении</name>
  <registerRecords>InformationRegister.Учащиеся</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Студенты</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяСтаростой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбучениеНаБюджетнойОснове</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОбучения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Учащиеся/Учащиеся.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Учащиеся</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </resources>
  <resources>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЯвляетсяСтаростой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбучениеНаБюджетнойОснове</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПриказОЗачислении/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОбработкаЗаполненияПриказаВызовСервера.ПроверитьКорректноеКоличествоСтаростВГруппе(Отказ, Ссылка, МоментВремени(),
		УчебнаяГруппа, Курс, Студенты, ЭтотОбъект);
	ОбработкаЗаполненияПриказаВызовСервера.ПроверитьСтудентНеУчится(Отказ, Студенты, Ссылка, МоментВремени(),
		ЭтотОбъект);

	Движения.Учащиеся.Записывать = Истина;
	// Регистр Учащиеся
	Для Каждого СтрокаСтудент Из Студенты Цикл
		Движение = Движения.Учащиеся.Добавить();
		Движение.Период = Дата;
		Движение.Студент = СтрокаСтудент.Студент;

		Движение.Факультет = Факультет;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Курс = Курс;

		Движение.ЯвляетсяСтаростой = СтрокаСтудент.ЯвляетсяСтаростой;
		Движение.ОбучениеНаБюджетнойОснове = СтрокаСтудент.ОбучениеНаБюджетнойОснове;
	КонецЦикла;

	Движения.Взаиморасчеты.Записывать = Истина;
	// Регистр Взаиморасчеты
	Для Каждого СтрокаСтудент Из Студенты Цикл
		Если СтрокаСтудент.СуммаОбучения > 0 Тогда
			Движение = Движения.Взаиморасчеты.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Студент = СтрокаСтудент.Студент;
			Движение.Сумма = СтрокаСтудент.СуммаОбучения;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ОбработкаЗаполненияПриказаВызовСервера.ПроверитьТабличнуюЧастьСтуденты(Отказ, Студенты, ЭтотОбъект);
	ОбработкаЗаполненияПриказаВызовСервера.ПроверитьКорректностьУчебногоКурса(Отказ, Курс, "Курс", ЭтотОбъект);
КонецПроцедуры
